InformationRegisters/DMS_СинхронизацияВнешнихИсточниковДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СинхронизацияВнешнихИсточниковДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяИсточникаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_СинхронизацияВнешнихИсточниковДанных/Ext/ManagerModule.bsl
Функция ПолучитьДанныеСинхронизации(Производитель) Экспорт
	Структура=Новый Структура;
	Запрос=Новый Запрос("Выбрать ИмяИсточникаДанных,ДатаПоследнейСинхронизации Из РегистрСведений.DMS_СинхронизацияВнешнихИсточниковДанных ГДЕ Производитель=&Производитель");
	Запрос.УстановитьПараметр("Производитель",Производитель);
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура.Вставить(Выборка.ИмяИсточникаДанных,Выборка.ДатаПоследнейСинхронизации)
	КонецЦикла;
	Возврат Структура
КонецФункции

//где СтруктураСинхронизации - (ИмяИсточникаДанных,ДатаПоследнейСинхронизации)
Функция УстановитьДанныеСинхронизации(Производитель,СтруктураСинхронизации) Экспорт
	Для Каждого Эл Из СтруктураСинхронизации Цикл 
		Рег=РегистрыСведений.DMS_СинхронизацияВнешнихИсточниковДанных.СоздатьМенеджерЗаписи();
		Рег.Производитель=Производитель;
		Рег.ИмяИсточникаДанных=Эл.Ключ;
		Рег.ДатаПоследнейСинхронизации=Эл.Значение;
		Рег.Записать(Истина);
	КонецЦикла;	
КонецФункции
